INSERT INTO student (name,surname,n_group,birth_date) VALUES ('Никита','Барютин',1055,'2004-11-11'), ('Бикита','Нарютин',1055,'2004-03-07'), ('Рюкита','Банитин',1021,'2004-08-01'), ('Нирюта','Бакитин',1012,'2003-05-30'), ('Никира','Батютин',1021,'2005-01-01'), ('Кинита','Тарюбин',1012,'2004-01-21'), ('Тикита','Барюнин',1012,'2004-07-26'), ('Барюта','Никитин',1055,'2004-10-10');

INSERT INTO hobby (name,risk) VALUES ('Шахматы',1),('Баскетбол',6),('Волейбол',5),('Хоккей',9),('Скалолазанье',10),('Велоспорт',5);

INSERT INTO student_hobby (student_id,hobby_id,start_date) VALUES (1,19,'2018-09-20'),(2,21,'2018-11-10'),(4,20,'2019-01-20'),(7,22,'2018-03-23'),(9,23,'2020-03-30'),(10,24,'2019-04-29'),(6,19,'2020-07-01'),(11,21,'2019-08-28'),(15,20,'2022-10-21'),(17,24,'2022-06-01'),(18,21,'2019-09-21'),(12,20,'2020-09-21');

INSERT INTO student_hobby (student_id,hobby_id,start_date,finish_date) VALUES (1,20,'2013-04-20','2020-12-13'),(3,20,'2014-04-20','2019-01-30'),(18,19,'2015-04-20','2017-10-10'),(16,24,'2014-09-12','2015-12-01'),(10,22,'2018-09-09','2019-07-17'),(13,23,'2021-07-20','2021-10-22'),(5,21,'2013-04-17','2023-07-13'),(9,19,'2013-04-20','2014-01-21'),(15,21,'2019-04-29','2023-04-17'),(1,24,'2019-07-01','2020-09-28'),(17,19,'2019-11-20','2020-02-09');

SELECT * FROM student;
SELECT * FROM hobby;
SELECT * FROM student_hobby;
